Repository: Whorlproject/Whorl
Catalog: lib/l10n/app_*.arb
Languages: pt, ru, zh

# appTitle
source: Secure Messenger
pt: Mensageiro Seguro
ru: Безопасный Мессенджер
zh: 安全信使

# helpTitle
source: Help & Onboarding
pt: Ajuda & Onboarding
ru: Помощь и Введение
zh: 帮助与入门

# helpIntro
source: Welcome to Secure Messenger! This app is 100% anonymous, peer-to-peer, and end-to-end encrypted.
pt: Bem-vindo ao Mensageiro Seguro! Este app é 100% anônimo, peer-to-peer e com criptografia de ponta a ponta.
ru: Добро пожаловать в Безопасный Мессенджер! Это приложение полностью анонимно, P2P и с сквозным шифрованием.
zh: 欢迎使用安全信使！本应用完全匿名，点对点，端到端加密。

# helpOrbotTitle
source: How to use with Tor/Orbot
pt: Como usar com Tor/Orbot
ru: Как использовать с Tor/Orbot
zh: 如何与 Tor/Orbot 一起使用

# helpOrbotStep1
source: 1. Install Orbot from the Play Store or F-Droid.
pt: 1. Instale o Orbot pela Play Store ou F-Droid.
ru: 1. Установите Orbot из Play Store или F-Droid.
zh: 1. 从 Play 商店或 F-Droid 安装 Orbot。

# helpOrbotStep2
source: 2. Open Orbot and start the Tor service.
pt: 2. Abra o Orbot e inicie o serviço Tor.
ru: 2. Откройте Orbot и запустите Tor.
zh: 2. 打开 Orbot 并启动 Tor 服务。

# helpOrbotStep3
source: 3. In Secure Messenger, enable Tor mode (top right switch).
pt: 3. No Mensageiro Seguro, ative o modo Tor (chave no topo direito).
ru: 3. В Безопасном Мессенджере включите режим Tor (переключатель вверху справа).
zh: 3. 在安全信使中，启用 Tor 模式（右上角开关）。

# helpOrbotStep4
source: 4. Share your Session ID (.onion) with your contacts.
pt: 4. Compartilhe seu Session ID (.onion) com seus contatos.
ru: 4. Поделитесь своим Session ID (.onion) с контактами.
zh: 4. 将您的 Session ID（.onion）分享给联系人。

# helpOrbotStep5
source: 5. To receive messages, keep Orbot and the app running.
pt: 5. Para receber mensagens, mantenha o Orbot e o app abertos.
ru: 5. Для получения сообщений держите Orbot и приложение открытыми.
zh: 5. 要接收消息，请保持 Orbot 和应用程序运行。

# helpContactAdd
source: Add contacts by their Session ID (public key or .onion address).
pt: Adicione contatos pelo Session ID (chave pública ou endereço .onion).
ru: Добавляйте контакты по Session ID (публичный ключ или .onion адрес).
zh: 通过 Session ID（公钥或 .onion 地址）添加联系人。

# helpPin
source: Set a PIN to unlock the app. Your PIN is never stored in plain text and is protected with Argon2id.
pt: Defina um PIN para desbloquear o app. Seu PIN nunca é salvo em texto claro e é protegido com Argon2id.
ru: Установите PIN для разблокировки приложения. Ваш PIN никогда не хранится в открытом виде и защищён с помощью Argon2id.
zh: 设置 PIN 以解锁应用。您的 PIN 永远不会以明文存储，并通过 Argon2id 保护。

# helpSecurity
source: All messages are encrypted with Curve25519 + XChaCha20-Poly1305. No metadata, no logs, no tracking.
pt: Todas as mensagens são criptografadas com Curve25519 + XChaCha20-Poly1305. Sem metadados, sem logs, sem rastreamento.
ru: Все сообщения шифруются Curve25519 + XChaCha20-Poly1305. Нет метаданных, нет логов, нет отслеживания.
zh: 所有消息均使用 Curve25519 + XChaCha20-Poly1305 加密。无元数据，无日志，无跟踪。

# helpPermissions
source: This app does NOT request camera, microphone, location, or contacts permissions by default.
pt: Este app NÃO solicita permissões de câmera, microfone, localização ou contatos por padrão.
ru: Это приложение НЕ запрашивает доступ к камере, микрофону, геолокации или контактам по умолчанию.
zh: 本应用默认不请求相机、麦克风、定位或联系人权限。

# helpQr
source: You can share your Session ID via QR code for easy contact addition.
pt: Você pode compartilhar seu Session ID via QR code para facilitar a adição de contatos.
ru: Вы можете поделиться своим Session ID через QR-код для удобного добавления контактов.
zh: 您可以通过二维码分享 Session ID，方便添加联系人。

# helpLang
source: You can change the app language in settings.
pt: Você pode mudar o idioma do app nas configurações.
ru: Вы можете изменить язык приложения в настройках.
zh: 您可以在设置中更改应用语言。

# helpSupport
source: For support, visit our website or contact us via .onion.
pt: Para suporte, visite nosso site ou entre em contato via .onion.
ru: Для поддержки посетите наш сайт или свяжитесь с нами через .onion.
zh: 如需支持，请访问我们的网站或通过 .onion 联系我们。

# pinSetTitle
source: Set PIN
pt: Definir PIN
ru: Установить PIN
zh: 设置 PIN

# pinEnterTitle
source: Enter PIN
pt: Digite o PIN
ru: Введите PIN
zh: 输入 PIN

# pinError
source: Incorrect PIN. Please try again.
pt: PIN incorreto. Tente novamente.
ru: Неверный PIN. Попробуйте снова.
zh: PIN 错误，请重试。

# pinForgot
source: Forgot PIN? Reset app (all data will be lost)
pt: Esqueceu o PIN? Redefina o app (todos os dados serão perdidos)
ru: Забыли PIN? Сбросьте приложение (все данные будут удалены)
zh: 忘记 PIN？重置应用（所有数据将丢失）

# contactAddTitle
source: Add Contact
pt: Adicionar Contato
ru: Добавить контакт
zh: 添加联系人

# contactIdHint
source: Enter Session ID or .onion address
pt: Digite o Session ID ou endereço .onion
ru: Введите Session ID или .onion адрес
zh: 输入 Session ID 或 .onion 地址

# contactAddButton
source: Add
pt: Adicionar
ru: Добавить
zh: 添加

source: Contact added!
pt: Contato adicionado!
ru: Контакт добавлен!
zh: 联系人已添加！

# contactInvalid
source: Invalid Session ID.
pt: Session ID inválido.
ru: Неверный Session ID.
zh: Session ID 无效。

# securityLogsTitle
source: Security Logs
pt: Logs de Segurança
ru: Журнал безопасности
zh: 安全日志

# torStatusOn
source: Tor mode enabled: all traffic is routed through Tor/Orbot for maximum anonymity.
pt: Modo Tor ativado: todo o tráfego passa pela rede Tor/Orbot para anonimato máximo.
ru: Режим Tor включён: весь трафик проходит через Tor/Orbot для максимальной анонимности.
zh: Tor 模式已启用：所有流量通过 Tor/Orbot 路由，实现最大匿名性。

# torStatusOff
source: Tor mode disabled: your IP may be visible on the local network.
pt: Modo Tor desativado: seu IP pode ser visível na rede local.
ru: Режим Tor выключен: ваш IP может быть виден в локальной сети.
zh: Tor 模式已禁用：您的 IP 可能在本地网络中可见。

# settingsTitle
source: Settings
pt: Configurações
ru: Настройки
zh: 设置

source: Language
pt: Idioma
ru: Язык
zh: 语言

source: About
pt: Sobre
ru: О приложении
zh: 关于

source: Logout
pt: Sair
ru: Выйти
zh: 退出

# noContacts
source: No contacts yet. Add one!
pt: Nenhum contato ainda. Adicione um!

source: Contact not found.
pt: Contato não encontrado.

# addressNotSet
source: Connection address not set for this contact. Edit the contact to add an IP or .onion.
pt: Endereço de conexão não definido para este contato. Edite o contato para adicionar um IP ou .onion.

# messageTooLong
source: Message too long (max 2000 characters)
pt: Mensagem muito longa (máx. 2000 caracteres)

source: Edit Contact
pt: Editar Contato

source: Save
pt: Salvar

source: Cancel
pt: Cancelar
ru: Отмена
zh: 取消

# connectionAddressLabel
source: Connection address (IP or .onion, optional)
pt: Endereço de conexão (IP ou .onion, opcional)

# fileAttachmentSoon
source: File attachment - Coming soon!
pt: Anexo de arquivo - Em breve!

source: Security Logs:
pt: Logs de Segurança:

# selfDestructIn
source: Self-destructs in {SECONDS}s
pt: Autodestrói em {SECONDS}s

# identityTitle
source: My Identity
pt: Minha Identidade

source: Copy Session ID
pt: Copiar Session ID

source: Session ID copied!
pt: Session ID copiado!

source: Chat Wallpaper
pt: Wallpaper do Chat

source: Choose Wallpaper
pt: Escolher Wallpaper

# wallpaperFeatureSoon
source: Image selection feature coming soon.
pt: Funcionalidade de seleção de imagem em breve.

source: Remove
pt: Remover

source: Wallpaper selected
pt: Wallpaper selecionado

# wallpaperDefault
source: Default
pt: Padrão

source: Dark mode
pt: Modo escuro

# pinLock
source: Require PIN to open app
pt: Exigir PIN para abrir o app

source: Theme color
pt: Cor do tema

# themeColorDesc
source: Change the main color of the app.
pt: Altere a cor principal do app.

source: Message bubble color
pt: Cor das mensagens

# messageBubbleColorDesc
source: Change the color of your messages.
pt: Altere a cor das suas mensagens.

# logoutConfirmTitle
source: Logout and delete account?
pt: Sair e apagar conta?

# logoutConfirmContent
source: This will erase all local data and return to the initial screen.
pt: Isso irá apagar todos os dados locais e voltar para a tela inicial.

# logoutConfirmButton
source: Delete and logout
pt: Apagar e sair

source: Unlock with biometrics
pt: Desbloquear com biometria
ru: Разблокировать с помощью биометрии
zh: 使用生物识别解锁

source: Reset
pt: Redefinir
ru: Сбросить
zh: 重置

# enterDisplayName
source: Please enter a display name
pt: Por favor, insira um nome de exibição
ru: Пожалуйста, введите отображаемое имя
zh: 请输入显示名称

# pinMinLength
source: PIN must be at least 6 digits
pt: O PIN deve ter pelo menos 6 dígitos
ru: PIN должен содержать не менее 6 цифр
zh: PIN 至少需要 6 位数字

# pinNoMatch
source: PINs do not match
pt: Os PINs não coincidem
ru: PIN-коды не совпадают
zh: PIN 不匹配

# setupFailed
source: Failed to setup account. Please try again.
pt: Falha ao configurar a conta. Tente novamente.
ru: Не удалось создать аккаунт. Пожалуйста, попробуйте еще раз.
zh: 帐户设置失败。请重试。

# errorOccurred
source: An error occurred: {error}
pt: Ocorreu um erro: {error}
ru: Произошла ошибка: {error}
zh: 发生错误：{error}

# createIdentity
source: Create Your Identity
pt: Crie sua Identidade
ru: Создайте свою личность
zh: 创建您的身份

# displayNamePinInfo
source: Your display name and PIN will be used to secure your account
pt: Seu nome de exibição e PIN serão usados para proteger sua conta
ru: Ваше отображаемое имя и PIN будут использоваться для защиты вашей учетной записи
zh: 您的显示名称和 PIN 将用于保护您的帐户

source: Display Name
pt: Nome de exibição
ru: Отображаемое имя
zh: 显示名称

# enterDisplayNameHint
source: Enter your display name
pt: Digite seu nome de exibição
ru: Введите ваше отображаемое имя
zh: 输入您的显示名称

# pinLabel
source: PIN (6+ digits)
pt: PIN (6+ dígitos)
ru: PIN (6+ цифр)
zh: PIN（6 位及以上数字）

# enterPinHint
source: Enter your PIN
pt: Digite seu PIN
ru: Введите ваш PIN
zh: 输入您的 PIN

# confirmPinLabel
source: Confirm PIN
pt: Confirmar PIN
ru: Подтвердите PIN
zh: 确认 PIN

# reenterPinHint
source: Re-enter your PIN
pt: Redigite seu PIN
ru: Введите PIN еще раз
zh: 请再次输入您的 PIN

source: Create Account
pt: Criar Conta
ru: Создать аккаунт
zh: 创建帐户

source: Security Notice
pt: Aviso de Segurança
ru: Уведомление о безопасности
zh: 安全提示

# pinSecurityInfo
source: Your PIN is used to encrypt your local data. If you forget it, your data cannot be recovered.
pt: Seu PIN é usado para criptografar seus dados locais. Se você esquecê-lo, seus dados não poderão ser recuperados.
ru: Ваш PIN используется для шифрования ваших локальных данных. Если вы его забудете, восстановить данные будет невозможно.
zh: 您的 PIN 用于加密本地数据。如果您忘记了 PIN，将无法恢复数据。

# securitySettingsTitle
source: Security Settings
pt: Configurações de Segurança
ru: Настройки безопасности
zh: 安全设置

# createOrChangePin
source: Create/Change PIN
pt: Criar/Alterar PIN
ru: Создать/Изменить PIN
zh: 创建/更改 PIN

# groupsTitle
source: Groups
pt: Grupos
ru: Группы
zh: 群组

source: Coming Soon
pt: Em breve
ru: Скоро будет
zh: 敬请期待

# createGroupTitle
source: Create Group
pt: Criar Grupo
ru: Создать группу
zh: 创建群组

# createIdentityTitle
source: Create Identity
pt: Criar Identidade
ru: Создать личность
zh: 创建身份

source: Get Started
pt: Começar a usar
ru: Начать использовать
zh: 开始使用

source: Wiping data...
pt: Apagando dados...
ru: Удаление данных...
zh: 正在清除数据...

# accountRemoved
source: Account removed successfully.
pt: Conta removida com sucesso.
ru: Аккаунт успешно удалён.
zh: 账户已成功删除。

# errorWipingData
source: Error wiping data. Try again.
pt: Erro ao apagar dados. Tente novamente.
ru: Ошибка при удалении данных. Попробуйте снова.
zh: 清除数据时出错。请重试。

source: Identity created successfully!
pt: Identidade criada com sucesso!
ru: Личность успешно создана!
zh: 身份创建成功！

# securityNoticeTitle
source: Security Notice
pt: Aviso de Segurança
ru: Уведомление о безопасности
zh: 安全提示

# securityNoticeBody
source: Keep your PIN in a safe place. It cannot be recovered if lost.
pt: Guarde seu PIN em local seguro. Ele não pode ser recuperado se perdido.
ru: Храните свой PIN-код в надежном месте. Его невозможно восстановить, если вы его потеряете.
zh: 请妥善保管您的PIN码，遗失后无法找回。
